package com.javarush.lesson3.task3_4;
/**
 * Created by Arsen on 19.02.2017.
 * Вывести на экран дату своего рождения в виде:
 * MAY 1 2012
 */
public class IBornTooMuchOld {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("MAY 1 2013");
    }
}
