package com.javarush.lesson3.task0304;
/**
 * Created by Arsen on 19.02.2017.
 * Вывести на экран произведение 10 чисел от 1 до 10.
 * Результат — это 1 число.

 * Подсказка:
 * будет три миллиона с хвостиком.
 */
public class ProductOf10Numbers {
    public static void main(String[] args) {
        System.out.println(1*2*3*4*5*6*7*8*9*10);
    }
}
