package com.javarush.lesson4.task44;

/**
 * Created by Arsen on 25.02.2017.
 * Ввести с клавиатуры три целых числа. Определить, имеется ли среди
 * них хотя бы одна пара равных между собой чисел.
 Если такая пара существует, вывести на экран числа через пробел.
 Если все три числа равны между собой, то вывести все три.

 Пример для чисел 1 2 2:
 2 2

 Пример для чисел 2 2 2:
 2 2 2
 */
public class IsTherePairOfNumbers {
    public static void main(String[] args) {
        for (int i = 0; i < 3; i++) {
            for (int j = 0; j < 3; j++) {
                //TODO: доделать!!
                int a = 0;
            }
        }
    }
}
