package com.javarush.lesson1.task1_6;
/**
 * Created by Arsen on 15.02.2017.
 */
public class ContractChange {
    public static void main(String[] args){
        System.out.println("Меня зовут Амиго.\r\n\r\n" +
                            "Я согласен на зарплату $800/месяц в первый год.\r\n" +
                            "Я согласен на зарплату $1500/месяц во второй год.\r\n" +
                            "Я согласен на зарплату $2200/месяц в третий год.\r\n" +
                            "Я согласен на зарплату $2700/месяц в четвертый год.\r\n" +
                            "Я согласен на зарплату $3200/месяц в пятый год.\r\n\r\n" +
                            "Поцелуй мой блестящий металлический зад!");
    }
}
