package com.javarush.lesson3.task0310;

/**
 * Created by Arsen on 24.02.2017.
 * Меркантильные намерения
 Вывести на экран десять раз надпись «Я хочу большую
 зарплату, и для этого изучаю Java»
 */
public class MertcantileIntentions {
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        }
    }
}
